taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationGetParentUIElementCommand.puml
@startuml
UIAutomationGetParentUIElementCommand --> AGetFromUIElementCommands
AGetFromUIElementCommands --> ADoSomethingUIElementCommands
AGetFromUIElementCommands --> IGetFromUIElementProperties
ADoSomethingUIElementCommands --> AUIElementCoreCommands
ADoSomethingUIElementCommands --> IDoSomethingUIElementProperties
AUIElementCoreCommands --> ScriptCommand
AUIElementCoreCommands --> IUIElementCoreProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
